Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostWarning
Fabric Sheet is placed completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.FabricSheetOutSideOfHostError
Fabric Sheet is placed completely outside of its host.

Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures.BentFabricSheetTooLongBendingProfile
The bent edge is shorter than the bend profile for this fabric sheet type.

Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures
Failures related to fabric sheet elements.